set_property SRC_FILE_INFO {cfile:/home/jeffdi/Caravel_on_FPGA/Caravel/vivado/caravel_artyA7/caravel_artyA7.gen/sources_1/ip/clk_wiz_0/clk_wiz_0/clk_wiz_0_in_context.xdc rfile:../../../../../caravel_artyA7.gen/sources_1/ip/clk_wiz_0/clk_wiz_0/clk_wiz_0_in_context.xdc id:1 order:EARLY scoped_inst:clock_div} [current_design]
set_property SRC_FILE_INFO {cfile:/home/jeffdi/Caravel_on_FPGA/Caravel/constr/caravel_artyA7.xdc rfile:../../../../../../../constr/caravel_artyA7.xdc id:2} [current_design]
set_property src_info {type:SCOPED_XDC file:1 line:1 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 10.000 -name clk_osc [get_ports clk_osc]
set_property src_info {type:SCOPED_XDC file:1 line:2 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name clock_div/clk_out1 -source [get_pins clock_div/clk_in1] -edges {1 2 3} -edge_shift {0.000 36.667 73.333} [get_pins clock_div/clk_out1]
set_property src_info {type:SCOPED_XDC file:1 line:3 export:INPUT save:INPUT read:READ} [current_design]
set_property IO_BUFFER_TYPE NONE [get_ports clk_osc]
set_property src_info {type:SCOPED_XDC file:1 line:4 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_BUFFER_TYPE NONE [get_ports clk_osc]
set_property src_info {type:SCOPED_XDC file:1 line:5 export:INPUT save:INPUT read:READ} [current_design]
set_property IS_IP_OOC_CELL true [get_cells clock_div]
set_property src_info {type:XDC file:2 line:10 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 83.330 -name clock -waveform {0.000 41.660} -add [get_pins clock_div/clk_out1]
set_property src_info {type:XDC file:2 line:56 export:INPUT save:INPUT read:READ} [current_design]
set_property max_fanout 50 [get_nets *]
set_property src_info {type:XDC file:2 line:63 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports flash_clk]
set_property src_info {type:XDC file:2 line:64 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports flash_csb]
set_property src_info {type:XDC file:2 line:67 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports flash_io0]
set_property src_info {type:XDC file:2 line:68 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports flash_io0]
set_property src_info {type:XDC file:2 line:70 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports flash_io1]
set_property src_info {type:XDC file:2 line:71 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports flash_io1]
set_property src_info {type:XDC file:2 line:73 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports gpio]
set_property src_info {type:XDC file:2 line:74 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports gpio]
set_property src_info {type:XDC file:2 line:76 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports {mprj_io[*]}]
set_property src_info {type:XDC file:2 line:77 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks clock] -add_delay 5.000 [get_ports {mprj_io[*]}]
set_property src_info {type:TCL file:{} line:-1 export:INPUT save:INPUT read:READ} [current_design]
set_property KEEP_HIERARCHY SOFT [get_cells clock_div]
